backend/loadtest/results/03_playlist_reorder.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/jeremycointre/music-room/backend/loadtest/03_playlist_reorder.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m15s max duration (incl. graceful stop):
              * editors: 20 looping VUs for 45s (gracefulStop: 30s)


running (0m01.0s), 20/20 VUs, 146 complete and 0 interrupted iterations
editors   [   2% ] 20 VUs  01.0s/45s

running (0m02.0s), 20/20 VUs, 294 complete and 0 interrupted iterations
editors   [   4% ] 20 VUs  02.0s/45s

running (0m03.0s), 20/20 VUs, 493 complete and 0 interrupted iterations
editors   [   7% ] 20 VUs  03.0s/45s

running (0m04.0s), 20/20 VUs, 645 complete and 0 interrupted iterations
editors   [   9% ] 20 VUs  04.0s/45s

running (0m05.0s), 20/20 VUs, 830 complete and 0 interrupted iterations
editors   [  11% ] 20 VUs  05.0s/45s

running (0m06.0s), 20/20 VUs, 1030 complete and 0 interrupted iterations
editors   [  13% ] 20 VUs  06.0s/45s

running (0m07.0s), 20/20 VUs, 1240 complete and 0 interrupted iterations
editors   [  16% ] 20 VUs  07.0s/45s

running (0m08.0s), 20/20 VUs, 1428 complete and 0 interrupted iterations
editors   [  18% ] 20 VUs  08.0s/45s

running (0m09.0s), 20/20 VUs, 1655 complete and 0 interrupted iterations
editors   [  20% ] 20 VUs  09.0s/45s

running (0m10.0s), 20/20 VUs, 1907 complete and 0 interrupted iterations
editors   [  22% ] 20 VUs  10.0s/45s

running (0m11.0s), 20/20 VUs, 2142 complete and 0 interrupted iterations
editors   [  24% ] 20 VUs  11.0s/45s

running (0m12.0s), 20/20 VUs, 2356 complete and 0 interrupted iterations
editors   [  27% ] 20 VUs  12.0s/45s

running (0m13.0s), 20/20 VUs, 2562 complete and 0 interrupted iterations
editors   [  29% ] 20 VUs  13.0s/45s

running (0m14.0s), 20/20 VUs, 2781 complete and 0 interrupted iterations
editors   [  31% ] 20 VUs  14.0s/45s

running (0m15.0s), 20/20 VUs, 2985 complete and 0 interrupted iterations
editors   [  33% ] 20 VUs  15.0s/45s

running (0m16.0s), 20/20 VUs, 3207 complete and 0 interrupted iterations
editors   [  36% ] 20 VUs  16.0s/45s

running (0m17.0s), 20/20 VUs, 3463 complete and 0 interrupted iterations
editors   [  38% ] 20 VUs  17.0s/45s

running (0m18.0s), 20/20 VUs, 3688 complete and 0 interrupted iterations
editors   [  40% ] 20 VUs  18.0s/45s

running (0m19.0s), 20/20 VUs, 3921 complete and 0 interrupted iterations
editors   [  42% ] 20 VUs  19.0s/45s

running (0m20.0s), 20/20 VUs, 4176 complete and 0 interrupted iterations
editors   [  44% ] 20 VUs  20.0s/45s

running (0m21.0s), 20/20 VUs, 4467 complete and 0 interrupted iterations
editors   [  47% ] 20 VUs  21.0s/45s

running (0m22.0s), 20/20 VUs, 4752 complete and 0 interrupted iterations
editors   [  49% ] 20 VUs  22.0s/45s

running (0m23.0s), 20/20 VUs, 5038 complete and 0 interrupted iterations
editors   [  51% ] 20 VUs  23.0s/45s

running (0m24.0s), 20/20 VUs, 5329 complete and 0 interrupted iterations
editors   [  53% ] 20 VUs  24.0s/45s

running (0m25.0s), 20/20 VUs, 5624 complete and 0 interrupted iterations
editors   [  56% ] 20 VUs  25.0s/45s

running (0m26.0s), 20/20 VUs, 5930 complete and 0 interrupted iterations
editors   [  58% ] 20 VUs  26.0s/45s

running (0m27.0s), 20/20 VUs, 6251 complete and 0 interrupted iterations
editors   [  60% ] 20 VUs  27.0s/45s

running (0m28.0s), 20/20 VUs, 6576 complete and 0 interrupted iterations
editors   [  62% ] 20 VUs  28.0s/45s

running (0m29.0s), 20/20 VUs, 6858 complete and 0 interrupted iterations
editors   [  64% ] 20 VUs  29.0s/45s

running (0m30.0s), 20/20 VUs, 7085 complete and 0 interrupted iterations
editors   [  67% ] 20 VUs  30.0s/45s

running (0m31.0s), 20/20 VUs, 7339 complete and 0 interrupted iterations
editors   [  69% ] 20 VUs  31.0s/45s

running (0m32.0s), 20/20 VUs, 7553 complete and 0 interrupted iterations
editors   [  71% ] 20 VUs  32.0s/45s

running (0m33.0s), 20/20 VUs, 7814 complete and 0 interrupted iterations
editors   [  73% ] 20 VUs  33.0s/45s

running (0m34.0s), 20/20 VUs, 8065 complete and 0 interrupted iterations
editors   [  76% ] 20 VUs  34.0s/45s

running (0m35.0s), 20/20 VUs, 8295 complete and 0 interrupted iterations
editors   [  78% ] 20 VUs  35.0s/45s

running (0m36.0s), 20/20 VUs, 8539 complete and 0 interrupted iterations
editors   [  80% ] 20 VUs  36.0s/45s

running (0m37.0s), 20/20 VUs, 8823 complete and 0 interrupted iterations
editors   [  82% ] 20 VUs  37.0s/45s

running (0m38.0s), 20/20 VUs, 9110 complete and 0 interrupted iterations
editors   [  84% ] 20 VUs  38.0s/45s

running (0m39.0s), 20/20 VUs, 9384 complete and 0 interrupted iterations
editors   [  87% ] 20 VUs  39.0s/45s

running (0m40.0s), 20/20 VUs, 9624 complete and 0 interrupted iterations
editors   [  89% ] 20 VUs  40.0s/45s

running (0m41.0s), 20/20 VUs, 9847 complete and 0 interrupted iterations
editors   [  91% ] 20 VUs  41.0s/45s

running (0m42.0s), 20/20 VUs, 10094 complete and 0 interrupted iterations
editors   [  93% ] 20 VUs  42.0s/45s

running (0m43.0s), 20/20 VUs, 10353 complete and 0 interrupted iterations
editors   [  96% ] 20 VUs  43.0s/45s

running (0m44.0s), 20/20 VUs, 10615 complete and 0 interrupted iterations
editors   [  98% ] 20 VUs  44.0s/45s

running (0m45.0s), 20/20 VUs, 10837 complete and 0 interrupted iterations
editors   [ 100% ] 20 VUs  45.0s/45s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<700' p(95)=77.53ms

    http_req_failed
    ✗ 'rate<0.02' rate=33.33%


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=27.63ms min=796µs   med=14.73ms max=348.86ms p(90)=67.31ms  p(95)=77.53ms 
      { expected_response:true }...: avg=38.7ms  min=3.67ms  med=33.79ms max=348.86ms p(90)=73.39ms  p(95)=84.08ms 
    http_req_failed................: 33.33% 10857 out of 32571
    http_reqs......................: 32571  721.144969/s

    EXECUTION
    iteration_duration.............: avg=83.14ms min=37.94ms med=78.71ms max=374.57ms p(90)=109.85ms p(95)=127.28ms
    iterations.....................: 10857  240.381656/s
    vus............................: 20     min=20             max=20
    vus_max........................: 20     min=20             max=20

    NETWORK
    data_received..................: 46 MB  1.0 MB/s
    data_sent......................: 10 MB  230 kB/s



running (0m45.2s), 00/20 VUs, 10857 complete and 0 interrupted iterations
editors ✓ [ 100% ] 20 VUs  45s
time="2026-05-24T00:11:58+01:00" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"