backend/loadtest/results/03_playlist_reorder.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/03_playlist_reorder.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m15s max duration (incl. graceful stop):
              * editors: 20 looping VUs for 45s (gracefulStop: 30s)


running (0m01.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
editors   [   2% ] 20 VUs  01.0s/45s

running (0m02.0s), 20/20 VUs, 41 complete and 0 interrupted iterations
editors   [   4% ] 20 VUs  02.0s/45s

running (0m03.0s), 20/20 VUs, 83 complete and 0 interrupted iterations
editors   [   7% ] 20 VUs  03.0s/45s

running (0m04.0s), 20/20 VUs, 121 complete and 0 interrupted iterations
editors   [   9% ] 20 VUs  04.0s/45s

running (0m05.0s), 20/20 VUs, 164 complete and 0 interrupted iterations
editors   [  11% ] 20 VUs  05.0s/45s

running (0m06.0s), 20/20 VUs, 205 complete and 0 interrupted iterations
editors   [  13% ] 20 VUs  06.0s/45s

running (0m07.0s), 20/20 VUs, 245 complete and 0 interrupted iterations
editors   [  16% ] 20 VUs  07.0s/45s

running (0m08.0s), 20/20 VUs, 285 complete and 0 interrupted iterations
editors   [  18% ] 20 VUs  08.0s/45s

running (0m09.0s), 20/20 VUs, 325 complete and 0 interrupted iterations
editors   [  20% ] 20 VUs  09.0s/45s

running (0m10.0s), 20/20 VUs, 353 complete and 0 interrupted iterations
editors   [  22% ] 20 VUs  10.0s/45s

running (0m11.0s), 20/20 VUs, 393 complete and 0 interrupted iterations
editors   [  24% ] 20 VUs  11.0s/45s

running (0m12.0s), 20/20 VUs, 435 complete and 0 interrupted iterations
editors   [  27% ] 20 VUs  12.0s/45s

running (0m13.0s), 20/20 VUs, 472 complete and 0 interrupted iterations
editors   [  29% ] 20 VUs  13.0s/45s

running (0m14.0s), 20/20 VUs, 495 complete and 0 interrupted iterations
editors   [  31% ] 20 VUs  14.0s/45s

running (0m15.0s), 20/20 VUs, 523 complete and 0 interrupted iterations
editors   [  33% ] 20 VUs  15.0s/45s

running (0m16.0s), 20/20 VUs, 564 complete and 0 interrupted iterations
editors   [  36% ] 20 VUs  16.0s/45s

running (0m17.0s), 20/20 VUs, 604 complete and 0 interrupted iterations
editors   [  38% ] 20 VUs  17.0s/45s

running (0m18.0s), 20/20 VUs, 645 complete and 0 interrupted iterations
editors   [  40% ] 20 VUs  18.0s/45s

running (0m19.0s), 20/20 VUs, 688 complete and 0 interrupted iterations
editors   [  42% ] 20 VUs  19.0s/45s

running (0m20.0s), 20/20 VUs, 730 complete and 0 interrupted iterations
editors   [  44% ] 20 VUs  20.0s/45s

running (0m21.0s), 20/20 VUs, 771 complete and 0 interrupted iterations
editors   [  47% ] 20 VUs  21.0s/45s

running (0m22.0s), 20/20 VUs, 804 complete and 0 interrupted iterations
editors   [  49% ] 20 VUs  22.0s/45s

running (0m23.0s), 20/20 VUs, 840 complete and 0 interrupted iterations
editors   [  51% ] 20 VUs  23.0s/45s

running (0m24.0s), 20/20 VUs, 882 complete and 0 interrupted iterations
editors   [  53% ] 20 VUs  24.0s/45s

running (0m25.0s), 20/20 VUs, 924 complete and 0 interrupted iterations
editors   [  56% ] 20 VUs  25.0s/45s

running (0m26.0s), 20/20 VUs, 964 complete and 0 interrupted iterations
editors   [  58% ] 20 VUs  26.0s/45s

running (0m27.0s), 20/20 VUs, 1006 complete and 0 interrupted iterations
editors   [  60% ] 20 VUs  27.0s/45s

running (0m28.0s), 20/20 VUs, 1037 complete and 0 interrupted iterations
editors   [  62% ] 20 VUs  28.0s/45s

running (0m29.0s), 20/20 VUs, 1073 complete and 0 interrupted iterations
editors   [  64% ] 20 VUs  29.0s/45s

running (0m30.0s), 20/20 VUs, 1093 complete and 0 interrupted iterations
editors   [  67% ] 20 VUs  30.0s/45s

running (0m31.0s), 20/20 VUs, 1137 complete and 0 interrupted iterations
editors   [  69% ] 20 VUs  31.0s/45s

running (0m32.0s), 20/20 VUs, 1177 complete and 0 interrupted iterations
editors   [  71% ] 20 VUs  32.0s/45s

running (0m33.0s), 20/20 VUs, 1220 complete and 0 interrupted iterations
editors   [  73% ] 20 VUs  33.0s/45s
time="2026-07-21T14:33:34+01:00" level=warning msg="The test has generated metrics with 100361 unique time series, which is higher than the suggested limit of 100000 and could cause high memory usage. Consider not using high-cardinality values like unique IDs as metric tags or, if you need them in the URL, use the name metric tag or URL grouping. See https://grafana.com/docs/k6/latest/using-k6/tags-and-groups/ for details." component=metrics-engine-ingester

running (0m34.0s), 20/20 VUs, 1244 complete and 0 interrupted iterations
editors   [  76% ] 20 VUs  34.0s/45s

running (0m35.0s), 20/20 VUs, 1284 complete and 0 interrupted iterations
editors   [  78% ] 20 VUs  35.0s/45s

running (0m36.0s), 20/20 VUs, 1328 complete and 0 interrupted iterations
editors   [  80% ] 20 VUs  36.0s/45s

running (0m37.0s), 20/20 VUs, 1371 complete and 0 interrupted iterations
editors   [  82% ] 20 VUs  37.0s/45s

running (0m38.0s), 20/20 VUs, 1412 complete and 0 interrupted iterations
editors   [  84% ] 20 VUs  38.0s/45s

running (0m39.0s), 20/20 VUs, 1458 complete and 0 interrupted iterations
editors   [  87% ] 20 VUs  39.0s/45s

running (0m40.0s), 20/20 VUs, 1495 complete and 0 interrupted iterations
editors   [  89% ] 20 VUs  40.0s/45s

running (0m41.0s), 20/20 VUs, 1536 complete and 0 interrupted iterations
editors   [  91% ] 20 VUs  41.0s/45s

running (0m42.0s), 20/20 VUs, 1576 complete and 0 interrupted iterations
editors   [  93% ] 20 VUs  42.0s/45s

running (0m43.0s), 20/20 VUs, 1616 complete and 0 interrupted iterations
editors   [  96% ] 20 VUs  43.0s/45s

running (0m44.0s), 20/20 VUs, 1658 complete and 0 interrupted iterations
editors   [  98% ] 20 VUs  44.0s/45s

running (0m45.0s), 20/20 VUs, 1699 complete and 0 interrupted iterations
editors   [ 100% ] 20 VUs  45.0s/45s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<700' p(95)=41.41ms

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 30942   682.301354/s
    checks_succeeded...: 100.00% 30942 out of 30942
    checks_failed......: 0.00%   0 out of 30942

    ✓ premium 200
    ✓ create playlist 201
    ✓ playlist add 201
    ✓ move 200
    ✓ list 200

    HTTP
    http_req_duration..............: avg=19.11ms  min=1.59ms   med=16.3ms  max=464.44ms p(90)=28.97ms  p(95)=41.41ms 
      { expected_response:true }...: avg=19.11ms  min=1.59ms   med=16.3ms  max=464.44ms p(90)=28.97ms  p(95)=41.41ms 
    http_req_failed................: 0.00% 0 out of 34380
    http_reqs......................: 34380 758.112615/s

    EXECUTION
    iteration_duration.............: avg=526.02ms min=364.27ms med=501.8ms max=1.09s    p(90)=623.15ms p(95)=684.42ms
    iterations.....................: 1719  37.905631/s
    vus............................: 20    min=20         max=20
    vus_max........................: 20    min=20         max=20

    NETWORK
    data_received..................: 59 MB 1.3 MB/s
    data_sent......................: 19 MB 421 kB/s



running (0m45.3s), 00/20 VUs, 1719 complete and 0 interrupted iterations
editors ✓ [ 100% ] 20 VUs  45s